interface Resources {
  "AboutPage": {
    "companyHistory": "Наша компания была основана в 2005 году двумя студентами университета. Они страстно увлекались пиццей и решили открыть свою собственную пиццерию. Первые шаги были нелегкими, но благодаря высокому качеству продукции, оригинальным рецептам и отличному обслуживанию мы быстро завоевали популярность в городе. nn Сегодня наша компания является одной из ведущих в области пиццы и имеет несколько ресторанов, расположенных в разных частях города. Мы также предлагаем услуги доставки нашей вкусной пиццы по всему городу, чтобы наши клиенты могли наслаждаться ею в уютной обстановке своего дома. nn Мы гордимся тем, что каждую пиццу готовим с любовью и только из натуральных ингредиентов. Мы тщательно выбираем свежие продукты и следим за качеством каждого шага приготовления. Наша команда поваров профессионалы своего дела и постоянно совершенствует свои навыки, чтобы предложить нашим клиентам самое лучшее кулинарное изыскание. nn Мы также заботимся о наших клиентах и стараемся создать комфортную и уютную атмосферу в наших ресторанах. Мы стремимся сделать каждое посещение нашего заведения приятным и запоминающимся для наших гостей.nn Благодарим вас за то, что выбираете нас! Мы остаёмся верны нашим принципам и обещаем продолжать радовать вас вкуснейшей пиццей, готовленной с любовью и заботой. nn Приходите к нам в гости и насладитесь непревзойденным вкусом наших пицц!",
    "branch1": "Наш первый филиал был открыт в 2005 году в маленьком провинциальном городке. В то время мы были небольшой командой энтузиастов, которые верили в потенциал нашей компании. Несмотря на небольшой стартовый капитал и ограниченные ресурсы, мы успешно справились со всеми трудностями. В первые годы нашей работы мы сосредоточились на предоставлении качественных услуг и установлении прочных связей с клиентами. Благодаря нашему упорному труду и отличной репутации, мы смогли расшириться и открыть новые филиалы по всей стране.",
    "branch2": "Наш второй филиал был открыт в 2010 году в самом сердце крупного мегаполиса. Мы понимали, что открытие второго филиала будет большим испытанием для нашей компании, но мы были готовы к вызову. Мы сделали ставку на новейшие технологии и инновационные подходы к бизнесу. Здесь мы предоставляем не только высококачественные услуги, но и создали уникальную атмосферу для наших клиентов. Наш второй филиал быстро стал популярным местом встреч и сотрудничества, привлекая как молодых предпринимателей, так и большие корпорации.",
    "aboutCompany": "О компании",
    "contacts": "Контакты",
    "address": "Адрес: г. Москва, ул. Примерная, д. 123",
    "phone": "Телефон: +7 (999) 123-45-67",
    "email": "Email: info@restaurant.ru"
  },
  "AuthPage": {
    "success": "Вы успешно вошли в систему! Здравствуйте!",
    "incorrect": "Неверно указан логин или пароль!",
    "welcome": "Здравствуйте!",
    "firstTimeGuests": "Если вы впервые у нас в гостях, и у вас нет аккаунта, то вы можете зарегистрироваться на нашем сайте.",
    "register": "Зарегистрироваться",
    "authentication": "Авторизация",
    "username": "Имя пользователя",
    "password": "Пароль",
    "pleaseEnterUsername": "Пожалуйста, введите имя пользователя!",
    "pleaseEnterPassword": "Пожалуйста, введите пароль!",
    "loginButton": "Войти",
    "forgotPassword": "Забыли пароль?",
    "restore": "Восстановите"
  },
  "Cart": {
    "cartTitle": "Корзина",
    "cartIsEmpty": "Ваша корзина пуста :(",
    "paymentTotal": "К оплате:"
  },
  "DefaultNS": {
    "dishNotFound": "Блюда не найдены"
  },
  "DishesPage": {
    "dishNotFound": "Блюда не найдены",
    "use": "Выбрать",
    "dishWeight": "Вес:",
    "compositionTooltip": "Состав",
    "price": "Цена:",
    "addToCart": "Добавить в корзину",
    "login": "Войти",
    "photoAlt": "Фото",
    "modalTitle": "Подробная информация о"
  },
  "Footer": {
    "footer": {
      "customers": {
        "title": "Клиентам",
        "how-to-order": "Как оформить заказ",
        "delivery": "Доставка товара",
        "payment": "Оплата товара",
        "receiving": "Получение товара",
        "returns": "Возврат товара",
        "customer-support": "Помощь покупателям",
        "gift-card": "Подарочная карта"
      },
      "company": {
        "title": "Компания",
        "about": "О компании",
        "jobs": "Вакансии",
        "news": "Новости",
        "privacy-policy": "Политика конфиденциальности",
        "terms-of-service": "Пользовательское соглашение"
      },
      "contacts": {
        "title": "Другое",
        "phone": "Телефон: 8 800 234 1000",
        "address": [
          "Екатеринбург, ул. Черняховского, 86/8",
          "Москва, Новоданиловская набережная, д.4, оф.31"
        ],
        "all-contacts": "Все контакты"
      },
      "copyright": "{{year}} Хозяйственный магазин"
    }
  },
  "Header": {
    "header": {
      "cityLink": "Выберите город",
      "hotline": "Телефон горячей линии: +89218493821",
      "workTime": "Сегодня с 9:00 до 00:00",
      "modalTitle": "Выберите город",
      "searchPlaceholder": "Поиск города",
      "cityUndefined": "Не определен"
    },
    "cities": [
      "Вологда",
      "Череповец",
      "Ярославль"
    ]
  },
  "NavigationMenu": {
    "navMenuItems": {
      "products": "Товары",
      "cart": "Корзина",
      "sign-in": "Войти",
      "about": "О компании",
      "privateOffice": "Личный кабинет",
      "user": {
        "profile": "Профиль",
        "delivery": "Текущие доставки",
        "order": "История заказов",
        "login": "Войти"
      },
      "category": {
        "category1": "Текстиль",
        "category2": "Мебель",
        "category3": "Фурнитура",
        "category4": "Инструменты",
        "category5": "Химия",
        "category6": "Дача",
        "category7": "Мелочь",
        "category8": "Дороги",
        "category9": "Свобода",
        "category10": "Оружие"
      }
    }
  },
  "RegisterPage": {
    "welcome": "Добро пожаловать!",
    "alreadyRegistered": "Если вы уже зарегистрированы на нашем сайте, то эта форма не для вас.",
    "register": "Регистрация",
    "email": "Email",
    "phoneNumber": "Номер телефона",
    "birthdate": "Дата рождения",
    "password": "Пароль",
    "pleaseEnterUsername": "Пожалуйста, введите имя пользователя!",
    "pleaseEnterPassword": "Пожалуйста, введите пароль!",
    "pleaseEnterEmail": "Пожалуйста, введите email!",
    "pleaseEnterPhoneNumber": "Пожалуйста, введите номер телефона!",
    "pleaseEnterBirthdate": "Пожалуйста, введите дату рождения!",
    "invalidPhoneNumber": "Некорректно введен номер телефона!",
    "yearOfBirthCannotBeBefore": "Год рождения не может быть раньше 1901.",
    "yearOfBirthCannotExceedCurrentDate": "Год рождения не может превышать текущую дату.",
    "registerButton": "Зарегистрироваться",
    "authButton": "Авторизоваться",
    "registerSuccess": "Вы успешно зарегистрированы.",
    "registerError": "Ошибка при регистрации.",
    "phoneInputPlaceholder": "+7-xxx-xxx-xx-xx",
    "nameUserPlaceholder": "Имя пользователя"
  },
  "Staff": {
    "notFound": "Такой страницы нет =(",
    "home": "Домой"
  },
  "UserPage": {
    "logoutSuccess": "Вы успешно вышли! До свидания!",
    "dataSaved": "Данные успешно сохранены!",
    "saveError": "Произошла ошибка при сохранении данных.",
    "enterUsername": "Пожалуйста, введите имя пользователя!",
    "enterEmail": "Пожалуйста, введите почту!",
    "enterBirthdate": "Пожалуйста, введите дату рождения!",
    "enterPhoneNumber": "Введите номер телефона",
    "phoneInputPlaceholder": "+7-xxx-xxx-xx-xx",
    "save": "Сохранить",
    "cancel": "Отменить",
    "name": "Имя:",
    "email": "E-mail:",
    "birthdate": "Дата рождения:",
    "phoneNumber": "Номер телефона:",
    "profileTab": "Профиль",
    "currentDeliveriesTab": "Текущие доставки",
    "orderHistoryTab": "История заказов",
    "notCurrentOrder": "Нет текущих заказов",
    "notHistoryOrder": "Нет выполненных заказов"
  }
}

export default Resources;
